Autodesk.Revit.DB.Plumbing.PipeSettings.SetPipeSlopes(System.Collections.Generic.IList`1{System.Double})
Set pipe slope values.
slopes:
Pipe slope values. Revit stores the slope value as a percentage (0-100).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Each value of the slopes must be between 0 and 100. Slope value is stored in percentage. e.g. 100 means 100%, and it is 45 degree.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.GetPipeSettings(Autodesk.Revit.DB.Document)
Get the pipe settings of the project.
aDoc:
The document.
Returns:
The pipe settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorTolerance
The connector tolerance value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for dValue is not finite
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation failed.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorSeparator
The connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation failed.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.SizePrefix
The size prefix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation failed.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.SizeSuffix
The size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation failed.
Since:
2012